app/controllers/libros_controller.rb

SELECT "libros".* FROM "libros"
---
    def index
        libros = Libro.all

SELECT "libros".* FROM "libros" WHERE "libros"."id" = 2 LIMIT 1
---
    def show
        libro = Libro.find(params[:id])